Revit 2024 API
OBJExportOptions.TargetUnit Property
 The unit type of geometry in the resultant OBJ file. Default value is ExportUnit::Default.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ExportUnit TargetUnit { get; set; }
Visual Basic
Public Property TargetUnit As ExportUnit
	Get
	Set
Visual C++
public:
property ExportUnit TargetUnit {
	ExportUnit get ();
	void set (ExportUnit value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
OBJExportOptions Class
Autodesk.Revit.DB Namespace